Documents/ESB/ESB_Consumer_0616/003TestSample/SAMPLE_XML_MUST/DebitCard/DC03_DbCardChngCtrlRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://https://www.nextbank.com.tw//xsd/TW/DebitCard/DbCardChngCtrlRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>DbCardChngCtrl</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:DbCardChngCtrlRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC03</v11:TxnId>  
        <v11:TxnNo>DC0300001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>4563020616112800</v11:CardNo>  
        <v11:BlkSrcId>2</v11:BlkSrcId>  
        <v11:BlkCode>1</v11:BlkCode>  
        <v11:BlkDate>20160524</v11:BlkDate>  
        <v11:BlkTime>111800</v11:BlkTime>  
        <v11:CntlrId>joe</v11:CntlrId>  
        <!--Optional:-->  
        <v11:Memo>註記</v11:Memo> 
      </v11:ServiceBody> 
    </v11:DbCardChngCtrlRq> 
  </soap:Body> 
</soap:Envelope>
